/**

 Принципы проектирования:

 1. Выделите аспекты приложения, которые могут изменятся, и отделите их
 от тех, которые всегда остаются постоянными
 2. Программируйте на уровне интерфейсов, а не на уровне реализации
 3. Стремитись к слабой связанности взаимодействующих объектов
 4. Предпочитайте композицию наследованию





  /*******************************************

 /********************************************
 Паттерн наблюдатель определяет отношение один ко многим между объектами
 таким образом , что при измении состояния одного объекта происходит автоматическое
 оповещение и обновление всех зависимых объектов
 /********************************************






 */